_posts/2014-09-27-Improved-debugging-of-Python-code-blocks-in-org-mode.html
---
title: Improved debugging of Python code blocks in org-mode
date: 2014/09/27 15:27:40
updated: 2014/09/27 15:27:40
categories: orgmode,python
tags: 
---


<p>
Writing and running code blocks in org-mode is awesome, when it works. I find as the code blocks get past a certain size though, it can be tedious to debug, especially for new users. Since I am teaching 59 students to use Python in org-mode, I see this issue a lot! They lack experience to avoid many simple errors, and to find and fix them. Even in my hands, I do not always want to be switching to Python mode to run and debug blocks. 
</p>

<p>
org-mode src-blocks offer a unique challenge for the usual tools like pylint and pychecker, because the code does not exist in a file. In this post, I will explore developing some functions that do syntax checking on a src block. We will use a simple method which will write the block to a temporary file, and to the checking on that block. Then, we will create temporary buffers with the output.
</p>

<p>
Here is the first idea. We create a temp file in the working directory, write the code to it, and run pychecker, pyflakes and pep8 on the file. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">org-pychecker</span> ()
  <span style="color: #228b22;">"Run pychecker on a source block"</span>
  (interactive)
  (<span style="color: #8b0000;">let</span> ((eop (org-element-at-point))
        (temporary-file-directory <span style="color: #228b22;">"."</span>)
        (tempfile))
    (<span style="color: #8b0000;">when</span> (and (eq 'src-block (car eop))
               (string= <span style="color: #228b22;">"python"</span> (org-element-property <span style="color: #cd0000;">:language</span> eop)))
      (setq tempfile (make-temp-file <span style="color: #228b22;">"pychecker"</span> nil <span style="color: #228b22;">".py"</span>))
      ;; <span style="color: #ff0000; font-weight: bold;">create code file</span>
      (<span style="color: #8b0000;">with-temp-file</span> tempfile
        (insert (org-element-property <span style="color: #cd0000;">:value</span> eop)))
      (switch-to-buffer <span style="color: #228b22;">"*pychecker*"</span>)
      (erase-buffer)
      (insert <span style="color: #228b22;">"pychecker\n=================\n"</span>)
      (insert
       (shell-command-to-string (format <span style="color: #228b22;">"pychecker %s"</span> (file-name-nondirectory tempfile))))
      (insert <span style="color: #228b22;">"\npyflakes\n=================\n"</span>)
      (insert
       (shell-command-to-string (format <span style="color: #228b22;">"pyflakes %s"</span> (file-name-nondirectory tempfile))))
      (insert <span style="color: #228b22;">"\npep8\n=================\n"</span>)
      (insert
       (shell-command-to-string (format <span style="color: #228b22;">"pep8 %s"</span> (file-name-nondirectory tempfile))))
      (delete-file tempfile))))
</pre>
</div>

<p>
Here is a sample code block with some errors in it.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #000000; background-color: #cccccc; font-weight: bold;">a</span> = <span style="color: #000000; background-color: #cccccc; font-weight: bold;">5</span>  <span style="color: #ff0000; font-weight: bold;"># a variable we do not use</span>


<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">f</span>(x, y):  <span style="color: #ff0000; font-weight: bold;"># unused argument</span>
    <span style="color: #8b0000;">return</span> x - b <span style="color: #ff0000; font-weight: bold;"># undefined variable</span>

<span style="color: #8b0000;">print</span> <span style="color: #000000; background-color: #cccccc; font-weight: bold;">6</span> * c
</pre>
</div>

<p>
On the code block above, that function leads to this output.
</p>

<pre class="example">
pychecker
=================
Processing module pychecker63858xo0 (pychecker63858xo0.py)...
  Caught exception importing module pychecker63858xo0:
    File "/Users/jkitchin/Library/Enthought/Canopy_64bit/User/lib/python2.7/site-packages/pychecker/pcmodules.py", line 540, in setupMainCode()
      module = imp.load_module(self.moduleName, handle, filename, smt)
    File "pychecker63858xo0.py", line 7, in &lt;module&gt;()
      print 6 * c
  NameError: name 'c' is not defined

Warnings...

pychecker63858xo0:1: NOT PROCESSED UNABLE TO IMPORT

pyflakes
=================
pychecker63858xo0.py:5: undefined name 'b'
pychecker63858xo0.py:7: undefined name 'c'

pep8
=================
pychecker63858xo0.py:5:17: E261 at least two spaces before inline comment
</pre>

<p>
That is pretty helpful, but it gives us line numbers we cannot directly access in our code block. We can open the code block in Python mode, and then navigate to them, but that is likely to make the buffer with this information disappear. It would be better if we could just click on a link and go to the right place. Let us explore what we need for that. 
</p>

<p>
We need to parse the output to get the line numbers, and then we can construct org-links to those places in the src block. pyflakes, pep8 and pylint look like the easiest to get. A way to get to the line would be a lisp function that moves to the beginning of the code block, and then moves forward n lines. We will use a regular expression on each line of the output of pyflakes and pep8 to get the line number. We will construct an org-link to go to the source block at the line. 
</p>

<p>
In this long code block, we create a function that will run pyflakes, pep8 and pylint, and create a new buffer with links to the issues it finds. Finally, we apply this as advice on executing org-babel-execute:python so it only runs when we execute a python block in org-mode. This is a long block, because I have made it pretty feature complete. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">org-py-check</span> ()
  <span style="color: #228b22;">"Run python check programs on a source block.</span>
<span style="color: #228b22;">Opens a buffer with links to what is found."</span>
  (interactive)
  (<span style="color: #8b0000;">let</span> ((eop (org-element-at-point))
        (temporary-file-directory <span style="color: #228b22;">"."</span>)
        (cb (current-buffer))
        (n) ; <span style="color: #ff0000; font-weight: bold;">for line number</span>
        (content) ; <span style="color: #ff0000; font-weight: bold;">error on line</span>
        (pb <span style="color: #228b22;">"*org pycheck*"</span>)
        (pyflakes-status nil)
        (link)
        (tempfile))

    (<span style="color: #8b0000;">unless</span> (executable-find <span style="color: #228b22;">"pyflakes"</span>)
      (<span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #228b22;">"pyflakes is not installed."</span>))
    
    (<span style="color: #8b0000;">unless</span> (executable-find <span style="color: #228b22;">"pep8"</span>)
      (<span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #228b22;">"pep8 not installed"</span>))

    (<span style="color: #8b0000;">unless</span> (executable-find <span style="color: #228b22;">"pylint"</span>)
      (<span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #228b22;">"pylint not installed"</span>))

    ;; <span style="color: #ff0000; font-weight: bold;">rm buffer if it exists</span>
    (<span style="color: #8b0000;">when</span> (get-buffer pb) (kill-buffer pb))
    
    ;; <span style="color: #ff0000; font-weight: bold;">only run if in a python code-block</span>
    (<span style="color: #8b0000;">when</span> (and (eq 'src-block (car eop))
               (string= <span style="color: #228b22;">"python"</span> (org-element-property <span style="color: #cd0000;">:language</span> eop)))

      ;; <span style="color: #ff0000; font-weight: bold;">tempfile for the code</span>
      (setq tempfile (make-temp-file <span style="color: #228b22;">"pychecker"</span> nil <span style="color: #228b22;">".py"</span>))
      ;; <span style="color: #ff0000; font-weight: bold;">create code file</span>
      (<span style="color: #8b0000;">with-temp-file</span> tempfile
        (insert (org-element-property <span style="color: #cd0000;">:value</span> eop)))
      
      (<span style="color: #8b0000;">let</span> ((status (shell-command
                     (format <span style="color: #228b22;">"pyflakes %s"</span> (file-name-nondirectory tempfile))))
            (output (delete <span style="color: #228b22;">""</span> (split-string
                                (<span style="color: #8b0000;">with-current-buffer</span> <span style="color: #228b22;">"*Shell Command Output*"</span>
                                  (buffer-string)) <span style="color: #228b22;">"\n"</span>))))
        (setq pyflakes-status status)
        (kill-buffer <span style="color: #228b22;">"*Shell Command Output*"</span>)
        (<span style="color: #8b0000;">when</span> output
          (set-buffer (get-buffer-create pb))
          (insert (format <span style="color: #228b22;">"\n* pyflakes output (status=%s)</span>
<span style="color: #228b22;">pyflakes checks your code for errors. You should probably fix all of these.</span>

<span style="color: #228b22;">"</span> status))
          (<span style="color: #8b0000;">dolist</span> (line output)
            ;; <span style="color: #ff0000; font-weight: bold;">get the line number</span>
            (<span style="color: #8b0000;">if</span> 
                (string-match (format <span style="color: #228b22;">"^%s:</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">(</span><span style="color: #228b22;">[0-9]*</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">)</span><span style="color: #228b22;">:</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">(</span><span style="color: #228b22;">.*</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">)</span><span style="color: #228b22;">"</span>
                                      (file-name-nondirectory tempfile))
                              line)
                (<span style="color: #8b0000;">progn</span>
                  (setq n (match-string 1 line))
                  (setq content (match-string 2 line))
                  (setq link (format <span style="color: #228b22;">"[[elisp:(progn (switch-to-buffer-other-window \"%s\")(goto-char %s)(forward-line %s))][%s]]\n"</span>
                                     cb
                                     (org-element-property <span style="color: #cd0000;">:begin</span> eop)
                                     n
                                     (format <span style="color: #228b22;">"Line %s: %s"</span> n content))))
              ;; <span style="color: #ff0000; font-weight: bold;">no match, just insert line</span>
              (setq link (concat line <span style="color: #228b22;">"\n"</span>)))
            (insert link))))

      (<span style="color: #8b0000;">let</span> ((status (shell-command
                     (format <span style="color: #228b22;">"pep8 %s"</span> (file-name-nondirectory tempfile))))
            (output (delete <span style="color: #228b22;">""</span> (split-string
                                (<span style="color: #8b0000;">with-current-buffer</span> <span style="color: #228b22;">"*Shell Command Output*"</span>
                                  (buffer-string)) <span style="color: #228b22;">"\n"</span>))))
        (kill-buffer <span style="color: #228b22;">"*Shell Command Output*"</span>)
        (<span style="color: #8b0000;">when</span> output
          (set-buffer (get-buffer-create pb))
          (insert (format <span style="color: #228b22;">"\n\n* pep8 output (status = %s)\n"</span> status))
          (insert <span style="color: #228b22;">"pep8 is the [[http://legacy.python.org/dev/peps/pep-0008][officially recommended style]] for writing Python code. Fixing these will usually make your code more readable and beautiful. Your code will probably run if you do not fix them, but, it will be ugly.</span>

<span style="color: #228b22;">"</span>)
          (<span style="color: #8b0000;">dolist</span> (line output)
            ;; <span style="color: #ff0000; font-weight: bold;">get the line number</span>
            (<span style="color: #8b0000;">if</span> 
                (string-match (format <span style="color: #228b22;">"^%s:</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">(</span><span style="color: #228b22;">[0-9]*</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">)</span><span style="color: #228b22;">:</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">(</span><span style="color: #228b22;">.*</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">)</span><span style="color: #228b22;">"</span>
                                      (file-name-nondirectory tempfile))
                              line)
                (<span style="color: #8b0000;">progn</span>
                  (setq n (match-string 1 line))
                  (setq content (match-string 2 line))
                  (setq link (format <span style="color: #228b22;">"[[elisp:(progn (switch-to-buffer-other-window \"%s\")(goto-char %s)(forward-line %s))][%s]]\n"</span>
                                     cb
                                     (org-element-property <span style="color: #cd0000;">:begin</span> eop)
                                     n
                                     (format <span style="color: #228b22;">"Line %s: %s"</span> n content))))
              ;; <span style="color: #ff0000; font-weight: bold;">no match, just insert line</span>
              (setq link (concat line <span style="color: #228b22;">"\n"</span>)))
            (insert link))))

      ;; <span style="color: #ff0000; font-weight: bold;">pylint</span>
      (<span style="color: #8b0000;">let</span> ((status (shell-command
                     (format <span style="color: #228b22;">"pylint -r no %s"</span> (file-name-nondirectory tempfile))))
            (output (delete <span style="color: #228b22;">""</span> (split-string
                                (<span style="color: #8b0000;">with-current-buffer</span> <span style="color: #228b22;">"*Shell Command Output*"</span>
                                  (buffer-string)) <span style="color: #228b22;">"\n"</span>))))
        (kill-buffer <span style="color: #228b22;">"*Shell Command Output*"</span>)
        (<span style="color: #8b0000;">when</span> output
          (set-buffer (get-buffer-create pb))
          (insert (format <span style="color: #228b22;">"\n\n* pylint (status = %s)\n"</span> status))
          (insert <span style="color: #228b22;">"pylint checks your code for errors, style and convention. It is complementary to pyflakes and pep8, and usually more detailed.</span>

<span style="color: #228b22;">"</span>)

          (<span style="color: #8b0000;">dolist</span> (line output)
            ;; <span style="color: #ff0000; font-weight: bold;">pylint gives a line and column number</span>
            (<span style="color: #8b0000;">if</span> 
                (string-match <span style="color: #228b22;">"[A-Z]:\\s-+</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">(</span><span style="color: #228b22;">[0-9]*</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">)</span><span style="color: #228b22;">,\\s-*</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">(</span><span style="color: #228b22;">[0-9]*</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">)</span><span style="color: #228b22;">:</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">(</span><span style="color: #228b22;">.*</span><span style="color: #228b22;">\\</span><span style="color: #228b22;">)</span><span style="color: #228b22;">"</span>                            
                              line)
                (<span style="color: #8b0000;">let</span> ((line-number (match-string 1 line))
                      (column-number (match-string 2 line))
                      (content (match-string 3 line)))
                     
                  (setq link (format <span style="color: #228b22;">"[[elisp:(progn (switch-to-buffer-other-window \"%s\")(goto-char %s)(forward-line %s)(forward-line 0)(forward-char %s))][%s]]\n"</span>
                                     cb
                                     (org-element-property <span style="color: #cd0000;">:begin</span> eop)
                                     line-number
                                     column-number
                                     line)))
              ;; <span style="color: #ff0000; font-weight: bold;">no match, just insert line</span>
              (setq link (concat line <span style="color: #228b22;">"\n"</span>)))
            (insert link))))
    
      (<span style="color: #8b0000;">when</span> (get-buffer pb)
        (switch-to-buffer-other-window pb)
        (goto-char (point-min))
        (insert <span style="color: #228b22;">"Press q to close the window\n"</span>)
        (org-mode)       
        (org-cycle '(64))
        ;; <span style="color: #ff0000; font-weight: bold;">make read-only and press q to quit</span>
        (setq buffer-read-only t)
        (use-local-map (copy-keymap org-mode-map))
        (local-set-key <span style="color: #228b22;">"q"</span> #'(<span style="color: #8b0000;">lambda</span> () (interactive) (kill-buffer))))

      (<span style="color: #8b0000;">unless</span> (= 0 pyflakes-status)
        (forward-line 4)
        (<span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #228b22;">"pyflakes exited non-zero. please fix errors"</span>))
      ;; <span style="color: #ff0000; font-weight: bold;">final cleanup and delete file</span>
      (delete-file tempfile)
      (switch-to-buffer-other-window cb))))


(<span style="color: #8b0000;">defadvice</span> <span style="color: #8b2323;">org-babel-execute:python</span> (before pychecker)
  (org-py-check))

(ad-activate 'org-babel-execute:python)
</pre>
</div>

<pre class="example">
org-babel-execute:python
</pre>

<p>
Now, when I try to run this code block, which has some errors in it:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #000000; background-color: #cccccc; font-weight: bold;">a</span> = <span style="color: #000000; background-color: #cccccc; font-weight: bold;">5</span>  <span style="color: #ff0000; font-weight: bold;"># a variable we do not use</span>


<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">f</span>(x, y):  <span style="color: #ff0000; font-weight: bold;"># unused argument</span>
    <span style="color: #8b0000;">return</span> x - b <span style="color: #ff0000; font-weight: bold;"># undefined</span>

<span style="color: #8b0000;">print</span> <span style="color: #000000; background-color: #cccccc; font-weight: bold;">6</span> * c
</pre>
</div>

<p>
I get a new buffer with approximately these contents:
</p>

<div class="org-src-container">

<pre class="src src-org">Press q to close the window

<span style="color: #8b2323;">* pyflakes output (status=1)</span>
pyflakes checks your code for errors. You should probably fix all of these.

<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 5))">Line 5:  undefined name 'b'</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 7))">Line 7:  undefined name 'c'</a></span>


<span style="color: #8b2323;">* pep8 output (status = 1)</span>
pep8 is the <span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="http://legacy.python.org/dev/peps/pep-0008">officially recommended style</a></span> for writing Python code. Fixing these will usually make your code more readable and beautiful. Your code will probably run if you do not fix them, but, it will be ugly.

<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 5))">Line 5: 17: E261 at least two spaces before inline comment</a></span>


<span style="color: #8b2323;">* pylint (status = 22)pylint checks your code for errors, style and convention. It is complementary to pyflakes and pep8, and usually more detailed.</span>

No config file found, using default configuration
<span style="color: #4682b4;">************* Module pychecker68224dkX</span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 1)(forward-line 0)(forward-char 0))">C:  1, 0: Invalid module name "pychecker68224dkX" (invalid-name)</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 1)(forward-line 0)(forward-char 0))">C:  1, 0: Missing module docstring (missing-docstring)</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 1)(forward-line 0)(forward-char 0))">C:  1, 0: Invalid constant name "a" (invalid-name)</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 4)(forward-line 0)(forward-char 0))">C:  4, 0: Invalid function name "f" (invalid-name)</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 4)(forward-line 0)(forward-char 0))">C:  4, 0: Invalid argument name "x" (invalid-name)</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 4)(forward-line 0)(forward-char 0))">C:  4, 0: Invalid argument name "y" (invalid-name)</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 4)(forward-line 0)(forward-char 0))">C:  4, 0: Missing function docstring (missing-docstring)</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 5)(forward-line 0)(forward-char 15))">E:  5,15: Undefined variable 'b' (undefined-variable)</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 4)(forward-line 0)(forward-char 9))">W:  4, 9: Unused argument 'y' (unused-argument)</a></span>
<span style="color: #0000ff; font-weight: bold; text-decoration: underline;"><a href="elisp:(progn (switch-to-buffer-other-window &quot;blog.org&quot;)(goto-char 9180)(forward-line 7)(forward-line 0)(forward-char 10))">E:  7,10: Undefined variable 'c' (undefined-variable)</a></span>
</pre>
</div>

<p>
Each of those links takes me to either the line, or the position of the error (in the case of pylint)! I have not tested this on more than a handful of code blocks, but it has worked pretty nicely on them so far!
</p>

<p>
Of course, you must have pyflakes, pep8 and pylint installed. But those are all easily installed with pip as far as I can tell.
</p>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/09/27/Improved-debugging-of-Python-code-blocks-in-org-mode.org">org-mode source</a><p><p>Org-mode version = 8.2.7c</p>